{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Python and Neo4j for Network Science\n",
    "\n",
    "In this notebook we'll look at how to combine Python and Neo4j to explore a network/graph containing interactions between Game of Thrones characters."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "import numpy as np\n",
    "import matplotlib.mlab as mlab\n",
    "import matplotlib.pyplot as plt\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=basic_auth(\"neo4j\", \"neo\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'labels_added': 187, 'relationships_created': 684, 'nodes_created': 187, 'properties_set': 1555}\n",
      "{'labels_added': 169, 'relationships_created': 775, 'nodes_created': 169, 'properties_set': 1719}\n",
      "{'labels_added': 142, 'relationships_created': 1008, 'nodes_created': 142, 'properties_set': 2158}\n",
      "{'labels_added': 298, 'relationships_created': 1329, 'nodes_created': 298, 'properties_set': 2956}\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    session.run(\"CREATE CONSTRAINT ON (c:Character) ASSERT c.name IS UNIQUE\")\n",
    "    \n",
    "    result = session.run(\"\"\"\\\n",
    "    LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book1-edges.csv\" AS row\n",
    "    MERGE (src:Character {name: row.Source})\n",
    "    MERGE (tgt:Character {name: row.Target})\n",
    "    // relationship for the book\n",
    "    MERGE (src)-[r:INTERACTS1]->(tgt)\n",
    "    ON CREATE SET r.weight = toInt(row.weight), r.book=1\n",
    "    \"\"\")\n",
    "    print(result.summary().counters)\n",
    "    \n",
    "    result = session.run(\"\"\"\\\n",
    "    LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book2-edges.csv\" AS row\n",
    "    MERGE (src:Character {name: row.Source})\n",
    "    MERGE (tgt:Character {name: row.Target})\n",
    "    // relationship for the book\n",
    "    MERGE (src)-[r:INTERACTS2]->(tgt)\n",
    "    ON CREATE SET r.weight = toInt(row.weight), r.book=2\n",
    "    \"\"\")    \n",
    "    print(result.summary().counters)\n",
    "    \n",
    "    result = session.run(\"\"\"\\\n",
    "    LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book3-edges.csv\" AS row\n",
    "    MERGE (src:Character {name: row.Source})\n",
    "    MERGE (tgt:Character {name: row.Target})\n",
    "    // relationship for the book\n",
    "    MERGE (src)-[r:INTERACTS3]->(tgt)\n",
    "    ON CREATE SET r.weight = toInt(row.weight), r.book=3\n",
    "    \"\"\") \n",
    "    print(result.summary().counters)\n",
    "    \n",
    "    result = session.run(\"\"\"\\\n",
    "    LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book45-edges.csv\" AS row\n",
    "    MERGE (src:Character {name: row.Source})\n",
    "    MERGE (tgt:Character {name: row.Target})\n",
    "    // relationship for the book\n",
    "    MERGE (src)-[r:INTERACTS45]->(tgt)\n",
    "    ON CREATE SET r.weight = toInt(row.weight), r.book=45\n",
    "    \"\"\")     \n",
    "    print(result.summary().counters)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## How many characters do we have?\n",
    "\n",
    "To get started let's run the query which calculates the number of characters in Game of Thrones and print it to the screen."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of characters: 796\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\\\n",
    "MATCH (c:Character)\n",
    "RETURN count(c) AS totalCharacters\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    row = result.peek()\n",
    "    print(\"Number of characters: {0}\".format(row[\"totalCharacters\"]))        "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## What's the distribution of interactions by characters? \n",
    "\n",
    "We can combine Neo4j and matplotlib to create a histogram that shows how interactions are spread out across our characters."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\\\n",
    "MATCH (c:Character)--()\n",
    "RETURN c, count(*) AS numberOfInteractions\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    interactions = [row[\"numberOfInteractions\"] for row in result]        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAYsAAAEKCAYAAADjDHn2AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAGrdJREFUeJzt3X2UXXV97/H3h0SCTzwYRqtJaILE\n24arl+oQ7bqKqFWDXIitQYKo4OXe2NZUrWXdRm8bY3StQilKrdhrEMqTNrCo1FSmRgSfbquYISAQ\nuNExpjDxgfAgGlk8hHzuH/s3ejiemX0myZ45yXxea82avX/7t898Z3OYT/Zv7/Pbsk1ERMRYDpjs\nAiIiovclLCIiolbCIiIiaiUsIiKiVsIiIiJqJSwiIqJWwiIiImolLCIiolbCIiIiak2f7AL2lsMP\nP9xz586d7DIiIvYpN9988322++r67TdhMXfuXAYHBye7jIiIfYqk/+imX4ahIiKiVsIiIiJqNRoW\nkhZJ2ixpSNKKDtuPk7RR0k5JS9q2HSHpS5LuknSnpLlN1hoREaNrLCwkTQMuBE4AFgCnSVrQ1u1u\n4Ezgsx1e4nLgPNu/DSwE7m2q1oiIGFuTF7gXAkO2twBIWgssBu4c6WB7a9m2q3XHEirTbV9f+u1o\nsM6IiKjR5DDULOCelvXh0taNFwA/lfQ5SbdIOq+cqURExCTo1Qvc04FXAGcDxwJHUg1XPYmkZZIG\nJQ1u3759YiuMiJhCmgyLbcCclvXZpa0bw8CttrfY3gn8M/Di9k6219jut93f11f7mZKIiNhNTYbF\nBmC+pHmSDgSWAuvGse+hkkYS4NW0XOuIiIiJ1dgFbts7JS0H1gPTgEtsb5K0Ghi0vU7SscC1wGHA\nSZI+ZPto209IOhu4QZKAm4GLmqoVYO6K6zq2bz3nxCZ/bETEPqHR6T5sDwADbW0rW5Y3UA1Pddr3\neuBFTdYXERHd6dUL3BER0UMSFhERUSthERERtRIWERFRK2ERERG1EhYREVErYREREbUSFhERUSth\nERERtRIWERFRK2ERERG1EhYREVErYREREbUSFhERUSthERERtRIWERFRK2ERERG1Gg0LSYskbZY0\nJGlFh+3HSdooaaekJR22HyxpWNInmqwzIiLG1lhYSJoGXAicACwATpO0oK3b3cCZwGdHeZkPA19v\nqsaIiOhOk2cWC4Eh21tsPwasBRa3drC91fZtwK72nSW9BHgO8KUGa4yIiC40GRazgHta1odLWy1J\nBwDnA2c3UFdERIxTr17g/mNgwPbwWJ0kLZM0KGlw+/btE1RaRMTUM73B194GzGlZn13auvG7wCsk\n/THwDOBASTtsP+kiue01wBqA/v5+73nJERHRSZNhsQGYL2keVUgsBd7SzY62Tx9ZlnQm0N8eFBER\nMXEaG4ayvRNYDqwH7gKutr1J0mpJJwNIOlbSMHAK8ClJm5qqJyIidl+TZxbYHgAG2tpWtixvoBqe\nGus1LgUubaC8iIjoUq9e4I6IiB6SsIiIiFoJi4iIqJWwiIiIWgmLiIiolbCIiIhaCYuIiKiVsIiI\niFoJi4iIqJWwiIiIWgmLiIiolbCIiIhaCYuIiKiVsIiIiFoJi4iIqJWwiIiIWgmLiIiolbCIiIha\njYaFpEWSNksakrSiw/bjJG2UtFPSkpb2YyR9U9ImSbdJOrXJOiMiYmyNhYWkacCFwAnAAuA0SQva\nut0NnAl8tq39YeDtto8GFgEXSDq0qVojImJs0xt87YXAkO0tAJLWAouBO0c62N5atu1q3dH2d1uW\nfyjpXqAP+GmD9UZExCiaHIaaBdzTsj5c2sZF0kLgQOD7HbYtkzQoaXD79u27XWhERIytpy9wS3ou\ncAXwDtu72rfbXmO733Z/X1/fxBcYETFFNBkW24A5LeuzS1tXJB0MXAf8b9vf2su1RUTEODQZFhuA\n+ZLmSToQWAqs62bH0v9a4HLb1zRYY0REdKGxsLC9E1gOrAfuAq62vUnSakknA0g6VtIwcArwKUmb\nyu5vBo4DzpR0a/k6pqlaIyJibE3eDYXtAWCgrW1ly/IGquGp9v2uBK5ssraIiOheT1/gjoiI3pCw\niIiIWgmLiIiolbCIiIhaCYuIiKiVsIiIiFoJi4iIqJWwiIiIWgmLiIiolbCIiIhaCYuIiKiVsIiI\niFoJi4iIqJWwiIiIWgmLiIiolbCIiIhaCYuIiKjVaFhIWiRps6QhSSs6bD9O0kZJOyUtadt2hqTv\nla8zmqwzIiLG1lhYSJoGXAicACwATpO0oK3b3cCZwGfb9n0W8EHgpcBC4IOSDmuq1oiIGFtXYSHp\nc5JOlDSecFkIDNneYvsxYC2wuLWD7a22bwN2te37euB62w/YfhC4Hlg0jp8dERF7Ubd//D8JvAX4\nnqRzJP2nLvaZBdzTsj5c2rqxJ/tGRMRe1lVY2P6y7dOBFwNbgS9L+ndJ75D0lCYLHIukZZIGJQ1u\n3759ssqIiNjvdT2sJGkm1fWF/wHcAvwtVXhcP8ou24A5LeuzS1s3utrX9hrb/bb7+/r6unzpiIgY\nr26vWVwLfAN4GnCS7ZNtX2X7T4BnjLLbBmC+pHmSDgSWAuu6rGs98DpJh5UL268rbRERMQmmd9nv\nItsDrQ2SZth+1HZ/px1s75S0nOqP/DTgEtubJK0GBm2vk3QscC1wGHCSpA/ZPtr2A5I+TBU4AKtt\nP7A7v2BEROy5bsPiI8BAW9s3qYahRlUCZqCtbWXL8gaqIaZO+14CXNJlfRER0aAxw0LSb1DdhfRU\nSb8DqGw6mGpIKiIipoC6M4vXU13Ung18tKX958AHGqopIiJ6zJhhYfsy4DJJb7L9TxNUU0RE9Ji6\nYai32r4SmCvpfe3bbX+0w24REbGfqRuGenr5PtrtsRERMQXUDUN9qnz/0MSUExERvahuGOrjY223\n/e69W05ERPSiumGomyekioiI6Gnd3A0VERFTXN0w1AW23yvpXwC3b7d9cmOVRUREz6gbhrqifP+b\npguJiIjeVTcMdXP5/rUyc+xvUZ1hbC5Pv4uIiCmgq4kEJZ0I/B/g+1TzQ82T9E7b/9pkcRER0Ru6\nnXX2fOBVtocAJD0fuA5IWERETAHdPinv5yNBUWyhmkwwIiKmgLq7of6gLA5KGgCuprpmcQq/ejBR\nRETs5+qGoU5qWf4J8MqyvB14aiMVRUREz6m7G+ode/LikhYBf0v1WNVP2z6nbfsM4HLgJcD9wKm2\nt0p6CvBpqifxTQcut/1Xe1JLRETsvm7vhjoIOAs4GjhopN32fx9jn2nAhcBrgWFgg6R1tu9s6XYW\n8KDtoyQtBc4FTqUa5pph+4WSngbcKekfbW8d128XERF7RbcXuK8AfoPqyXlfo3pyXt0F7oXAkO0t\n5TMZa4HFbX0WAyNTilwDvEaSqK6LPF3SdKrhrseAn3VZa0RE7GXdhsVRtv8S+EWZL+pE4KU1+8wC\n7mlZHy5tHfvY3gk8BMykCo5fAD8C7gb+xvYDXdYaERF7Wbdh8Xj5/lNJ/xk4BHh2MyUB1VnJE8Dz\ngHnAn0k6sr2TpGWSBiUNbt++vcFyIiKmtm7DYo2kw4C/BNYBd1JdXxjLNmBOy/rs0taxTxlyOoTq\nQvdbgC/aftz2vcC/Af3tP8D2Gtv9tvv7+vq6/FUiImK8ugoL25+2/aDtr9k+0vazR56iN4YNwHxJ\n88q8UkupgqbVOuCMsrwEuNG2qYaeXg0g6enAy4D/192vFBERe1tXYSFppqS/k7RR0s2SLpA0c6x9\nyjWI5cB64C7gatubJK2WNDK1+cXATElDwPuAFaX9QuAZkjZRhc4/2L5t/L9eRETsDd3ODbUW+Drw\nprJ+OnAV8Htj7WR7ABhoa1vZsvwI1W2y7fvt6NQeERGTo9uweK7tD7esf0TSqU0UFBERvafbC9xf\nkrRU0gHl681Uw0sRETEF1E0k+HOqD8gJeC9wZdl0ALADOLvR6iIioifUzQ31zIkqJCIiele31ywo\ndzAdV1a/avsLzZQUERG9pttbZ88B3kP1Ybw7gfdIyiywERFTRLdnFm8AjrG9C0DSZcAtwPubKiwi\nInpHt3dDARzasnzI3i4kIiJ6V7dnFn8F3CLpK1R3Rh3Hrz5tHRER+7nasCjPl/i/VPMzHVua/9z2\nj5ssLCIiekdtWNi2pAHbL+TXJwKMiIgpoNtrFhslHVvfLSIi9kfdXrN4KfBWSVupnmAnqpOOFzVV\nWERE9I5uw+L1jVYRERE9rW5uqIOAPwSOAm4HLi7PqYiIiCmk7prFZVSPM70dOAE4v/GKIiKi59QN\nQy0od0Eh6WLg282XFBERvabuzOLxkYXdGX6StEjSZklDkn7tQ3ySZki6qmy/SdLclm0vkvRNSZsk\n3V6GxCIiYhLUnVn8F0k/K8sCnlrWR+6GOni0HSVNo3qW9muBYWCDpHW272zpdhbwoO2jJC0FzgVO\nlTSd6tkZb7P9nfK878eJiIhJUfc8i2l78NoLgSHbWwAkrQUWU81aO2IxsKosXwN8onxi/HXAbba/\nU+q4fw/qiIiIPTSeiQTHaxZwT8v6cGnr2KcMcz0EzAReAFjSekkbJf2vBuuMiIgaXT/8aIJNB15O\nNRfVw8ANkm62fUNrJ0nLgGUARxxxxIQXGRExVTR5ZrENmNOyPru0dexTrlMcAtxPdRbyddv32X4Y\nGABe3P4DbK+x3W+7v6+vr4FfISIioNmw2ADMlzRP0oHAUn59IsJ1wBlleQlwo20D64EXSnpaCZFX\n8uRrHRERMYEaG4ayvVPScqo//NOAS2xvkrQaGLS9DrgYuELSEPAAVaBg+0FJH6UKHAMDtq9rqtaI\niBhbo9csbA9QDSG1tq1sWX4EOGWUfa+kun02IiImWZPDUBERsZ9IWERERK2ERURE1EpYRERErYRF\nRETUSlhERESthEVERNRKWERERK2ERURE1EpYRERErYRFRETUSlhERESthEVERNRKWERERK2ERURE\n1EpYRERErYRFRETUSlhEREStRsNC0iJJmyUNSVrRYfsMSVeV7TdJmtu2/QhJOySd3WSdERExtsbC\nQtI04ELgBGABcJqkBW3dzgIetH0U8DHg3LbtHwX+takaIyKiO02eWSwEhmxvsf0YsBZY3NZnMXBZ\nWb4GeI0kAUh6I/ADYFODNUZERBeaDItZwD0t68OlrWMf2zuBh4CZkp4B/DnwobF+gKRlkgYlDW7f\nvn2vFR4REU/Wqxe4VwEfs71jrE6219jut93f19c3MZVFRExB0xt87W3AnJb12aWtU59hSdOBQ4D7\ngZcCSyT9NXAosEvSI7Y/0WC9ERExiibDYgMwX9I8qlBYCrylrc864Azgm8AS4EbbBl4x0kHSKmBH\ngiIiYvI0Fha2d0paDqwHpgGX2N4kaTUwaHsdcDFwhaQh4AGqQImIiB7T5JkFtgeAgba2lS3LjwCn\n1LzGqkaKi4iIrvXqBe6IiOghCYuIiKiVsIiIiFoJi4iIqNXoBe79wdwV13Vs33rOiRNcSUTE5MmZ\nRURE1EpYRERErYRFRETUSlhERESthEVERNRKWERERK2ERURE1EpYRERErYRFRETUSlhERESthEVE\nRNRKWERERK1Gw0LSIkmbJQ1JWtFh+wxJV5XtN0maW9pfK+lmSbeX769uss6IiBhbY2EhaRpwIXAC\nsAA4TdKCtm5nAQ/aPgr4GHBuab8POMn2C4EzgCuaqjMiIuo1eWaxEBiyvcX2Y8BaYHFbn8XAZWX5\nGuA1kmT7Fts/LO2bgKdKmtFgrRERMYYmw2IWcE/L+nBp69jH9k7gIWBmW583ARttP9pQnRERUaOn\nH34k6WiqoanXjbJ9GbAM4IgjjpjAyiIippYmzyy2AXNa1meXto59JE0HDgHuL+uzgWuBt9v+fqcf\nYHuN7X7b/X19fXu5/IiIGNFkWGwA5kuaJ+lAYCmwrq3POqoL2ABLgBttW9KhwHXACtv/1mCNERHR\nhcbColyDWA6sB+4Crra9SdJqSSeXbhcDMyUNAe8DRm6vXQ4cBayUdGv5enZTtUZExNgavWZhewAY\naGtb2bL8CHBKh/0+AnykydoiIqJ7+QR3RETUSlhERESthEVERNRKWERERK2e/lBeL5u74rqO7VvP\nOXGCK4mIaF7OLCIiolbCIiIiaiUsIiKiVsIiIiJqJSwiIqJWwiIiImrl1tm9bLy31OYW3IjYF+TM\nIiIiaiUsIiKiVoahJshow00REfuCnFlEREStnFn0qFz4johe0uiZhaRFkjZLGpK0osP2GZKuKttv\nkjS3Zdv7S/tmSa9vss6IiBhbY2cWkqYBFwKvBYaBDZLW2b6zpdtZwIO2j5K0FDgXOFXSAmApcDTw\nPODLkl5g+4mm6t1fjXWtJGcpEdGtJoehFgJDtrcASFoLLAZaw2IxsKosXwN8QpJK+1rbjwI/kDRU\nXu+bDda7T9udC+gZ6oqIbjUZFrOAe1rWh4GXjtbH9k5JDwEzS/u32vad1Vyp+46JuKtqX7lza7yh\ntju/V68FZy/+t2n6GDX9j5p96X0xmf/A26cvcEtaBiwrqzskbd6NlzkcuG/vVbVf6sljpHN76mf0\n5DGaCJN1jCbiv/8E/+zdPj57WM9vdtOpybDYBsxpWZ9d2jr1GZY0HTgEuL/LfbG9BlizJ0VKGrTd\nvyevsb/LMaqXY1Qvx2hsvX58mrwbagMwX9I8SQdSXbBe19ZnHXBGWV4C3GjbpX1puVtqHjAf+HaD\ntUZExBgaO7Mo1yCWA+uBacAltjdJWg0M2l4HXAxcUS5gP0AVKJR+V1NdDN8JvCt3QkVETB5V/5Cf\nuiQtK8NZMYoco3o5RvVyjMbW68dnyodFRETUy9xQERFRa0qHRd10JFOVpK2Sbpd0q6TB0vYsSddL\n+l75fthk1zmRJF0i6V5Jd7S0dTwmqny8vK9uk/Tiyat8YoxyfFZJ2lbeR7dKekPLtik3nY+kOZK+\nIulOSZskvae07xPvoykbFi3TkZwALABOK9OMROVVto9puZVvBXCD7fnADWV9KrkUWNTWNtoxOYHq\nDr75VJ8D+vsJqnEyXcqvHx+Aj5X30TG2BwDapvNZBHyy/P+4v9sJ/JntBcDLgHeVY7FPvI+mbFjQ\nMh2J7ceAkelIorPFwGVl+TLgjZNYy4Sz/XWqO/ZajXZMFgOXu/It4FBJz52YSifHKMdnNL+czsf2\nD4CR6Xz2a7Z/ZHtjWf45cBfVzBT7xPtoKodFp+lIMqVIxcCXJN1cPiUP8BzbPyrLPwaeMzml9ZTR\njkneW7+yvAyhXNIydDnlj0+ZYft3gJvYR95HUzksYnQvt/1iqtPgd0k6rnVj+eBkbqNrkWPS0d8D\nzweOAX4EnD+55fQGSc8A/gl4r+2ftW7r5ffRVA6LrqYUmYpsbyvf7wWupRoi+MnIKXD5fu/kVdgz\nRjsmeW8Btn9i+wnbu4CL+NVQ05Q9PpKeQhUUn7H9udK8T7yPpnJYdDMdyZQj6emSnjmyDLwOuIMn\nT81yBvD5yamwp4x2TNYBby93s7wMeKhlmGHKaBtf/32q9xFM0el8yuMXLgbusv3Rlk37xPton551\ndk+MNh3JJJfVC54DXFu9r5kOfNb2FyVtAK6WdBbwH8CbJ7HGCSfpH4HjgcMlDQMfBM6h8zEZAN5A\ndeH2YeAdE17wBBvl+Bwv6RiqYZWtwDthSk/n81+BtwG3S7q1tH2AfeR9lE9wR0RErak8DBUREV1K\nWERERK2ERURE1EpYRERErYRFRETUSljEpJNkSee3rJ8tadVeeu1LJS3ZG69V83NOkXSXpK+0tT9P\n0jVd7P+B5qr75c+YK+ktLev9kj7e9M+N/UPCInrBo8AfSDp8sgtpJWk8n0M6C/iftl/V2mj7h7a7\nCatxh8VuzNQ6F/hlWNgetP3u8f7cmJoSFtELdgJrgD9t39B+ZiBpR/l+vKSvSfq8pC2SzpF0uqRv\nq3oWx/NbXub3JA1K+q6k/1b2nybpPEkbykR372x53W9IWkf1obH2ek4rr3+HpHNL20rg5cDFks5r\n6z9X5RkPks6U9DlJXyzPLvjr0n4O8FRVz3z4TGl7a/ldbpX0qZFgkLRD0vmSvgP8rqSV5Xe4Q9Ka\n8ilhJB0l6cuSviNpYzke5wCvKK/5p+V3/ULp/yxJ/1yOxbckvai0r1I1CeBXy3F+d2l/uqTryuvf\nIenU8fwHj32Q7Xzla1K/gB3AwVSf8j0EOBtYVbZdCixp7Vu+Hw/8FHguMINqzpwPlW3vAS5o2f+L\nVP8wmk81c+dBVM8H+IvSZwYwCMwrr/sLYF6HOp8H3A30UX26/UbgjWXbV4H+DvvMBe4oy2cCW8rv\neBDVp3XntP5eZfm3gX8BnlLWPwm8vSwbeHNL32e1LF8BnFSWbwJ+vywfBDyt/G5faOn/y3Xg74AP\nluVXA7eW5VXAv5djdDhwP/AU4E3ARS2vdchkv4/y1exXziyiJ7iaffNyYDzDIhtcPSPgUeD7wJdK\n++1Uf6RHXG17l+3vUf2x/i2qOa/eXqZduAmYSRUmAN929ZyFdscCX7W93fZO4DPAcR36jeUG2w/Z\nfoTqzOU3O/R5DfASYEOp7zXAkWXbE1QT0Y14laSbJN1O9Uf+aFVze82yfS2A7UdsP1xT18upwgbb\nNwIzJR1ctl3n6tkT91FNcvccqmP8WknnSnqF7YfGdRRinzNl54aKnnQBsBH4h5a2nZThUkkHAAe2\nbHu0ZXlXy/ounvzebp/TxoCAP7G9vnWDpOOpziya0lrzE3T+f1DAZbbf32HbIy7zKEk6iOqso9/2\nPeWmgIP2cr3QoWbb31X1mM83AB+RdIPt1Q387OgRObOInmH7AeBqqovFI7ZS/Ssb4GSqIZDxOkXS\nAWXc/khgM9UEkn+kaspoJL1A1Sy7Y/k28EpJh5drCKcBX9uNejp5fKQWqkdrLpH07FLbsyR1OgMZ\nCYb7VD0jYQn88ilsw5LeWPafIelpwM+BZ47y878BnF76Hw/c57ZnLbSS9DzgYdtXAucB+/1zxqe6\nnFlErzkfWN6yfhHw+XJB94vs3r/676b6Q38w8Ie2H5H0aaqhqo3lovB2ah4Va/tHklYAX6H61/91\ntvfWVO1rgNskbbR9uqS/oHpa4QHA48C7qK5xtNbzU0kXUU39/WOqafdHvA34lKTVZf9TgNuAJ8qx\nvBS4paX/KuASSbdRzXB6BmN7IXCepF3l9f9o/L9y7Esy62xERNTKMFRERNRKWERERK2ERURE1EpY\nRERErYRFRETUSlhERESthEVERNRKWERERK3/D2OG6n7xbRhRAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x110f7d3c8>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plt.hist(interactions, normed=True, bins=50)\n",
    "plt.ylabel('Probability');\n",
    "plt.xlabel('Number of interactions');\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Unsurprisingly the majority of characters don't say much! This looks like a classic long tail/power law chart."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Summary Statistics\n",
    "\n",
    "We can calculate summary statistics on the interactions of characters:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record min=1 max=148 avg_characters=6.578856152513001 stdev=14.16045587171888>\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\\\n",
    "MATCH (c:Character)-->()\n",
    "WITH c, count(*) AS num\n",
    "RETURN min(num) AS min, max(num) AS max, avg(num) AS avg_characters, stdev(num) AS stdev\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    print(result.peek())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can run the following query to calculate those statistics on a book by book basis:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record book=1 min=1 max=51 avg_characters=4.920863309352515 stdev=7.0967074915280755>\n",
      "<Record book=2 min=1 max=37 avg_characters=4.015544041450779 stdev=5.360422756122164>\n",
      "<Record book=3 min=1 max=36 avg_characters=4.289361702127663 stdev=5.335866147079831>\n",
      "<Record book=45 min=1 max=57 avg_characters=3.691666666666668 stdev=5.636326417753424>\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\\\n",
    "MATCH (c:Character)-[r]->()\n",
    "WITH r.book as book, c, count(*) AS num\n",
    "RETURN book, min(num) AS min, max(num) AS max, avg(num) AS avg_characters, stdev(num) AS stdev\n",
    "ORDER BY book\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    for row in result:\n",
    "        print(row)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Pivotal nodes\n",
    "\n",
    "A node is said to be pivotal if it lies on all shortest paths between two other nodes in the network. We can find all pivotal nodes in the network.\n",
    "\n",
    "The following query will find all the pivotal nodes in the network for the first book:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record a.name='Eroeh' b.name='Rickard-Karstark' PivotalNode='Eddard-Stark' pathLength=3 pathCount=1>\n",
      "<Record a.name='Eroeh' b.name='Dywen' PivotalNode='Daenerys-Targaryen' pathLength=4 pathCount=2>\n",
      "<Record a.name='Eroeh' b.name='Dywen' PivotalNode='Jon-Snow' pathLength=4 pathCount=2>\n",
      "<Record a.name='Pypar' b.name='Kevan-Lannister' PivotalNode='Tyrion-Lannister' pathLength=3 pathCount=2>\n",
      "<Record a.name='Daryn-Hornwood' b.name='Catelyn-Stark' PivotalNode='Eddard-Stark' pathLength=2 pathCount=1>\n",
      "<Record a.name='Clydas' b.name='Gared' PivotalNode='Aemon-Targaryen-(Maester-Aemon)' pathLength=3 pathCount=1>\n",
      "<Record a.name='Clydas' b.name='Gared' PivotalNode='Jeor-Mormont' pathLength=3 pathCount=1>\n",
      "<Record a.name='Rickon-Stark' b.name='Gared' PivotalNode='Jeor-Mormont' pathLength=3 pathCount=3>\n",
      "<Record a.name='Ogo' b.name='Myrcella-Baratheon' PivotalNode='Drogo' pathLength=3 pathCount=1>\n",
      "<Record a.name='Ogo' b.name='Myrcella-Baratheon' PivotalNode='Robert-Baratheon' pathLength=3 pathCount=1>\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\\\n",
    "MATCH (a:Character), (b:Character) WHERE id(a) > id(b)\n",
    "MATCH p = allShortestPaths((a)-[:INTERACTS1*]-(b))\n",
    "\n",
    "WITH collect(p) AS paths, a, b\n",
    "UNWIND nodes(head(paths)) as c // first path\n",
    "\n",
    "WITH *\n",
    "WHERE NOT c IN [a,b]\n",
    "AND all(path IN tail(paths) WHERE c IN nodes(path))\n",
    "\n",
    "RETURN a.name, b.name, c.name AS PivotalNode, length(head(paths)) AS pathLength, length(paths) AS pathCount\n",
    "SKIP 490\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    for row in result:\n",
    "        print(row)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Querying with Pandas\n",
    "\n",
    "We can take the results of Cypher queries and do further processing using the Pandas library.\n",
    "\n",
    "For example here we find the first 5 rows using the Pandas `head()` function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   interactions             name\n",
      "0             7           Todder\n",
      "1             1          Matthar\n",
      "2             1            Othor\n",
      "3             8   Paxter-Redwyne\n",
      "4             1  Ulf-son-of-Umar\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\\\n",
    "match (c:Character) \n",
    "return c.name AS name, size((c)--()) AS interactions\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "df = pd.DataFrame([dict(record) for record in result])\n",
    "print(df.head())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We could do our filtering using Pandas as well. The following code finds some of the characters who have more than 5 different interactions:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "df.query('interactions>5').head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can find the characters with the least interactions as well:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>interactions</th>\n",
       "      <th>name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2</td>\n",
       "      <td>Aegon-V-Targaryen</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>279</th>\n",
       "      <td>2</td>\n",
       "      <td>Smiling-Knight</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>535</th>\n",
       "      <td>2</td>\n",
       "      <td>Wick-Whittlestick</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>285</th>\n",
       "      <td>2</td>\n",
       "      <td>Oznak-zo-Pahl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>287</th>\n",
       "      <td>2</td>\n",
       "      <td>Robin-Ryger</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     interactions               name\n",
       "5               2  Aegon-V-Targaryen\n",
       "279             2     Smiling-Knight\n",
       "535             2  Wick-Whittlestick\n",
       "285             2      Oznak-zo-Pahl\n",
       "287             2        Robin-Ryger"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.query('1 < interactions <5').sort_values(by=[\"interactions\"], ascending = True).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We could analyse the pivotal nodes query from earlier as well:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "        PivotalNode            p1             p2  pathCount  pathLength\n",
      "0             Drogo  Rickon-Stark           Fogo          9           5\n",
      "1               Ogo  Rickon-Stark           Fogo          9           5\n",
      "2     Samwell-Tarly   Wyl-(guard)  Randyll-Tarly          5           4\n",
      "3        Bran-Stark          Hali         Shagga          1           3\n",
      "4  Tyrion-Lannister          Hali         Shagga          1           3\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\\\n",
    "MATCH (a:Character), (b:Character) WHERE id(a) > id(b)\n",
    "MATCH p = allShortestPaths((a)-[:INTERACTS1*]-(b))\n",
    "\n",
    "WITH collect(p) AS paths, a, b\n",
    "UNWIND nodes(head(paths)) as c // first path\n",
    "\n",
    "WITH *\n",
    "WHERE NOT c IN [a,b]\n",
    "AND all(path IN tail(paths) WHERE c IN nodes(path))\n",
    "\n",
    "RETURN a.name AS p1, b.name AS p2, c.name AS PivotalNode, length(head(paths)) AS pathLength, length(paths) AS pathCount\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "df = pd.DataFrame([dict(record) for record in result])\n",
    "print(df.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pathCount</th>\n",
       "      <th>pathLength</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>PivotalNode</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Danwell-Frey</th>\n",
       "      <td>5.608696</td>\n",
       "      <td>4.777174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Ogo</th>\n",
       "      <td>2.043243</td>\n",
       "      <td>4.627027</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Mace-Tyrell</th>\n",
       "      <td>5.632432</td>\n",
       "      <td>4.508108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Walder-Frey</th>\n",
       "      <td>5.633880</td>\n",
       "      <td>4.459016</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Karyl-Vance</th>\n",
       "      <td>5.470270</td>\n",
       "      <td>4.448649</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              pathCount  pathLength\n",
       "PivotalNode                        \n",
       "Danwell-Frey   5.608696    4.777174\n",
       "Ogo            2.043243    4.627027\n",
       "Mace-Tyrell    5.632432    4.508108\n",
       "Walder-Frey    5.633880    4.459016\n",
       "Karyl-Vance    5.470270    4.448649"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.groupby(['PivotalNode']).mean().sort_values(by=[\"pathLength\"], ascending=False).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
